``` ─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.jenkins-workers-bronze[0] will be created
  + resource "aws_route53_record" "jenkins-workers-bronze" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "worker-0.bronze.build.galaxyproject.eu"
      + records         = (known after apply)
      + ttl             = 7200
      + type            = "A"
      + zone_id         = "Z386N8B8JBC6TQ"
    }

  # openstack_blockstorage_volume_v2.jenkins-workers-bronze-volume[0] will be created
  + resource "openstack_blockstorage_volume_v2" "jenkins-workers-bronze-volume" {
      + attachment        = (known after apply)
      + availability_zone = (known after apply)
      + description       = "Data volume for Jenkins worker-0.bronze.build.galaxyproject.eu"
      + id                = (known after apply)
      + metadata          = (known after apply)
      + name              = "jenkins-workers-bronze-volume"
      + region            = (known after apply)
      + size              = 200
      + volume_type       = "default"
    }

  # openstack_compute_instance_v2.jenkins-workers-bronze[0] will be created
  + resource "openstack_compute_instance_v2" "jenkins-workers-bronze" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.xlarge"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = "jenkins-worker-v60-j73-a83d3bdea80b-dev"
      + key_pair            = "jenkins2"
      + name                = "worker-0.bronze.build.galaxyproject.eu"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "default",
        ]
      + stop_before_destroy = false
      + user_data           = "0cd3c1a9d50fa22664f4bfbf321c9a4aa50007a1"

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "bioinf"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # openstack_compute_volume_attach_v2.jenkins-workers-bronze-va[0] will be created
  + resource "openstack_compute_volume_attach_v2" "jenkins-workers-bronze-va" {
      + device      = (known after apply)
      + id          = (known after apply)
      + instance_id = (known after apply)
      + region      = (known after apply)
      + volume_id   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan" ```